app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @user = User.includes(:set_goals, :tended_goals).find_by(id: params[:id])